In [3]:
#instale o pandas
# pip install pandas
import pandas as pd
pd.__version__

'1.5.3'

# Manipulando Em DataFrames do Pandas

In [4]:
#Criando um dicionário
dados = {'Estado':['Santa Catarina','Rio De Janeiro','Toantins','Bahia','Minas Gerais'], 
                   'Ano': [2004, 2005, 2006, 2007, 2008],
                    'Taxa De Desemprego': [1.5, 1.7, 1.6, 2.4, 2.7]}

In [5]:
#Importa a função DataFrames do Pandas
from pandas import DataFrame

In [6]:
#Converte Dicionário em um DataFrame
df = DataFrame(dados)

In [7]:
#vizualiza as primeiras 5 linhas:
df.head()

           Estado   Ano  Taxa De Desemprego
0  Santa Catarina  2004                 1.5
1  Rio De Janeiro  2005                 1.7
2        Toantins  2006                 1.6
3           Bahia  2007                 2.4
4    Minas Gerais  2008                 2.7

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
#Reorganizando Colunas
DataFrame(dados, columns = ['Estado', 'Taxa De Desemprego', 'Ano'])

           Estado  Taxa De Desemprego   Ano
0  Santa Catarina                 1.5  2004
1  Rio De Janeiro                 1.7  2005
2        Toantins                 1.6  2006
3           Bahia                 2.4  2007
4    Minas Gerais                 2.7  2008

In [10]:
#Acrescentando Nova Coluna e adicionando indices
df2 = DataFrame(dados, columns = ['Estado', 'Taxa De Desemprego', 'Taxa Crescimento', 'Ano'],
               index = ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [11]:
df2

                 Estado  Taxa De Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina                 1.5              NaN  2004
estado2  Rio De Janeiro                 1.7              NaN  2005
estado3        Toantins                 1.6              NaN  2006
estado4           Bahia                 2.4              NaN  2007
estado5    Minas Gerais                 2.7              NaN  2008

In [12]:
df2.columns

Index(['Estado', 'Taxa De Desemprego', 'Taxa Crescimento', 'Ano'], dtype='object')

In [13]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio De Janeiro', 1.7, nan, 2005],
       ['Toantins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [14]:
df2['Estado']

estado1    Santa Catarina
estado2    Rio De Janeiro
estado3          Toantins
estado4             Bahia
estado5      Minas Gerais
Name: Estado, dtype: object

In [15]:
#Filtrando pelo indice retornando para eixo 0.
df2.filter(items = ['estado3'], axis = 0)

           Estado  Taxa De Desemprego Taxa Crescimento   Ano
estado3  Toantins                 1.6              NaN  2006

# Numpy e Pandas

In [16]:
df2.head()

                 Estado  Taxa De Desemprego Taxa Crescimento   Ano
estado1  Santa Catarina                 1.5              NaN  2004
estado2  Rio De Janeiro                 1.7              NaN  2005
estado3        Toantins                 1.6              NaN  2006
estado4           Bahia                 2.4              NaN  2007
estado5    Minas Gerais                 2.7              NaN  2008

In [17]:
#Metodo Describe faz resumo estatístico
df2.describe()

       Taxa De Desemprego          Ano
count            5.000000     5.000000
mean             1.980000  2006.000000
std              0.535724     1.581139
min              1.500000  2004.000000
25%              1.600000  2005.000000
50%              1.700000  2006.000000
75%              2.400000  2007.000000
max              2.700000  2008.000000

# Preenchendo Valores ausentes

In [22]:
#Carregando arquivo csv
dsa_df = pd_read_csv("dataset.csv")

NameError: name 'pd_read_csv' is not defined